; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v6 ?v5)
             (pred_7 ?v13 ?v7)
             (pred_8 ?v6 ?v7)
             (pred_11 ?v12 ?v6 )
	     (pred_10 ?v6)
             (pred_9 ?v4)
             (pred_5 ?v13)
             (pred_6 ?v7)
             (pred_1 ?v6)
             (pred_3 ?v13)
             (pred_2 ?v6)
             (pred_4 ))



(:action op_3
:parameters (?v8 ?v11 ?v10 ?v3)
:precondition (and (pred_9 ?v8) (pred_9 ?v11) (pred_5 ?v10) (pred_6 ?v3)
          (pred_12 ?v8 ?v11) (pred_7 ?v10 ?v3)
                   (pred_8 ?v11 ?v3) (pred_10 ?v8) 
                   (pred_1 ?v11) (pred_3 ?v10))
:effect (and  (pred_2 ?v11) (not (pred_1 ?v11))))


(:action op_2
:parameters (?v8 ?v9)
:precondition (and (pred_9 ?v8) (pred_9 ?v9)
               (pred_10 ?v8) (pred_12 ?v8 ?v9) (pred_2 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v8))))

(:action op_1
:parameters (?v8 ?v10)
:precondition (and (pred_9 ?v8) (pred_5 ?v10) 
                  (pred_10 ?v8) (pred_11 ?v10 ?v8) (pred_4 ))
:effect (and (pred_3 ?v10)
   (not (pred_11 ?v10 ?v8)) (not (pred_4 ))))


(:action op_4
:parameters (?v8 ?v2 ?v1)
:precondition (and (pred_9 ?v8) (pred_5 ?v2) (pred_5 ?v1)
                  (pred_10 ?v8) (pred_3 ?v1) (pred_11 ?v2 ?v8))
:effect (and (pred_3 ?v2) (pred_11 ?v1 ?v8)
        (not (pred_3 ?v1)) (not (pred_11 ?v2 ?v8))))

(:action op_5
:parameters (?v8 ?v10)
:precondition (and (pred_9 ?v8) (pred_5 ?v10) 
                  (pred_10 ?v8) (pred_3 ?v10))
:effect (and (pred_4 ) (pred_11 ?v10 ?v8) (not (pred_3 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_15 obj_09 obj_20 obj_18 obj_16 obj_11 obj_12 obj_14 obj_07 obj_02 obj_03 obj_01 obj_08 obj_19 obj_13
    obj_17 obj_05
    obj_06 obj_04
    )

    (:init
       (pred_4)

       (pred_9 obj_10)
       (pred_9 obj_15)
       (pred_9 obj_09)
       (pred_9 obj_20)
       (pred_9 obj_18)
       (pred_9 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_12)
       (pred_9 obj_14)
       (pred_9 obj_07)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_9 obj_01)
       (pred_9 obj_08)
       (pred_9 obj_19)
       (pred_9 obj_13)
       (pred_6 obj_17)
       (pred_6 obj_05)
       (pred_5 obj_06)
       (pred_5 obj_04)

       (pred_12 obj_10 obj_18)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_15 obj_16)
       (pred_12 obj_15 obj_09)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_09 obj_20)
       (pred_12 obj_09 obj_15)
       (pred_12 obj_20 obj_12)
       (pred_12 obj_20 obj_09)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_16)
       (pred_12 obj_18 obj_10)
       (pred_12 obj_16 obj_07)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_16 obj_15)
       (pred_12 obj_16 obj_18)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_11 obj_12)
       (pred_12 obj_11 obj_09)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_12 obj_03)
       (pred_12 obj_12 obj_20)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_14 obj_01)
       (pred_12 obj_14 obj_07)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_07 obj_02)
       (pred_12 obj_07 obj_16)
       (pred_12 obj_07 obj_14)
       (pred_12 obj_02 obj_19)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_02 obj_07)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_03 obj_12)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_01 obj_08)
       (pred_12 obj_01 obj_14)
       (pred_12 obj_08 obj_19)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_08 obj_01)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_19 obj_02)
       (pred_12 obj_19 obj_08)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_13 obj_19)
       (pred_1 obj_20)
       (pred_1 obj_14)
       (pred_8  obj_20 obj_17)
       (pred_8  obj_14 obj_05)
       (pred_2 obj_10)
       (pred_2 obj_15)
       (pred_2 obj_09)
       (pred_2 obj_18)
       (pred_2 obj_16)
       (pred_2 obj_11)
       (pred_2 obj_12)
       (pred_2 obj_07)
       (pred_2 obj_02)
       (pred_2 obj_03)
       (pred_2 obj_01)
       (pred_2 obj_08)
       (pred_2 obj_19)
       (pred_2 obj_13)

       (pred_7  obj_06 obj_17)
       (pred_7  obj_04 obj_05)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_04 obj_16)
       (pred_10 obj_15)
    )

    (:goal (and
       (pred_11 obj_04 obj_19)
    ))
(:constraints
  (always (not (pred_10 obj_02)))
)
)

; plan
1. (op_2 obj_15 obj_16)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_16)
   goals met: 0 of 1
2. (op_1 obj_16 obj_04)
   deleted: (pred_11 obj_04 obj_16) (pred_4)
   added: (pred_3 obj_04)
   goals met: 0 of 1
3. (op_2 obj_16 obj_07)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_07)
   goals met: 0 of 1
4. (op_2 obj_07 obj_08)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_08)
   goals met: 0 of 1
5. (op_2 obj_08 obj_19)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_19)
   goals met: 0 of 1
6. (op_5 obj_19 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_4) (pred_11 obj_04 obj_19)
   goals met: 1 of 1
